{"one": {"file_name": "Figures_Ext/CPC.jpg", "caption": "CPC (Climate Process Chain) linking circumpolar westerlies in the Antarctic to heavy rainfall events in southwest southern Africa. Adapted from Daron, J., Burgin, L., Janes, T., Jones, R.G. \\& Jack, C. 2019. Climate process chains: Examples from southern Africa. International Journal of Climatology. 0(0). DOI: 10.1002/joc.6106.", "link": "", "key": "one"}, "two": {"file_name": "figure_2.png", "caption": "Monthly precipitation (mm) from 27 CMIP5 models (grey) and NOAA 20th Century Reanalysis (blue) utilising the nearest grid point to 34°S 18°E. top left: Historical ensemble considering 1950-2005. Top right: rcp8.5 ensemble considering 2045-2100. Bottom: Rainfall anomaly (rcp8.5 – historical) considering the same periods, 33rd-67th percentile indicated by box and 10th – 90th percentile indicated by whisker extent.", "link": "https://github.com/peterm790/MASTERS/blob/main/projections/pr/PR\\_Change\\_boxplot.ipynb", "key": "two"}, "three": {"file_name": "Figures_Ext/CAPE_TOWN_INTNL_AIRPORT_Total_monthly_rainfall_RCP_85_2050_2070.png", "caption": "Total monthly rainfall anomaly under the RCP8.5 scenario considering the period 2050-2070 against an 1980-2000 baseline. Figure available from: https:/cip.csag.uct.ac.za/", "link": "", "key": "three"}, "four": {"file_name": "Figures_Ext/Knutti_genealogy.jpg", "caption": "\"(a) The model “family tree” from CMIP3 and CMIP5 (marked with asterisks) control climate observations (ERA40/GPCP and NCEP/CMAP), shown as a dendrogram (a hierarchical clustering of the pairwise distance matrix for temperature and precipitation fields) Some of the models with obvious similarities in code or produced by the same institution are marked with the same color. Models appearing in the same branch are close, and similarity is larger the more to the left the branches separate, for a detailed description of the method see Masson \\& Knutti, (2011)) (b) Same but based on the predicted change in temperature and precipitation fields for the end of the 21st century in the RCP8.5 scenario relative to control.\" Adapted from Knutti, R., Masson, D. \\& Gettelman, A. 2013. Climate model genealogy: Generation CMIP5 and how we got there. Geophysical Research Letters. 40(6):1194–1199. DOI: 10.1002/grl.50256 ", "link": "", "key": "four"}, "six": {"file_name": "103_togif.png", "caption": "Illustration of the process of calculating the ‘1-dimensional’ jet stream metric using the ACCESS1-0 model as an example. Left – 500-250 hPa pressure weighted average of daily mean zonal wind. Middle – considering only the lower level 850-700 hPa levels. Right – After Lanczos filter has been applied to the 850-700 hPa levels. Jet Latitude denoted by the solid line, FWHM captured as the distance between the dashed lines and Speed as the maximum zonal mean velocity, 15.9 m/s on this particular day.", "link": "https://github.com/peterm790/MASTERS/blob/main/JET/Plots\\_1D.ipynb", "key": "six"}, "seven": {"file_name": "kde_pdf.png", "caption": "Jet latitude, width and velocity distributions, approximated using the kernel density methods described above. Dark lines indicate the distributions of the ACESS1-0 model in this case, while dashed lines are that of NOAA 20th Century Reanalysis.  Lighter lines in the background are that of the CMIP5 models.", "link": "", "key": "seven"}, "eight": {"file_name": "area_diff.png", "caption": "Visualization of the area difference between the latitude distributions of HadCM3 and that of NOAA 20th Century Reanalysis", "link": "https://github.com/peterm790/MASTERS/blob/main/JET/Plots\\_1D.ipynb", "key": "eight"}, "nine": {"file_name": "seas_jet_shift.png", "caption": "Jet Latitude (a), Width (b) and Velocity (c) distributions decomposed into different seasons, approximated using the Kernel Density methods described above", "link": "https://github.com/peterm790/MASTERS/blob/main/JET/Plots\\_1D.ipynb", "key": "nine"}, "ten": {"file_name": "2d_jet_probs.png", "caption": "NOAA 20th Century Reanalysis mean jet probability field. Contours indicate probability of jet stream being defined over the grid point in a given day. Correlations between seasonal jet probability and seasonal WRZ precipitation shaded, cross hatching indicates significance at p$>$0.05", "link": "https://github.com/peterm790/MASTERS/blob/main/JET/Plots\\_2D.ipynb", "key": "ten"}, "eleven": {"file_name": "", "caption": "", "link": "", "key": "eleven"}, "thirteen": {"file_name": "D0_jet_shift.png", "caption": "Kernel Density Estimates of extended winter (AMJJAS) jet latitude, width and velocity during the period 2015-2017 (red) contrasted against climatology (1980-2017) (black)", "link": "https://github.com/peterm790/MASTERS/blob/main/JET/Day\\_Zero\\_1D.ipynb", "key": "thirteen"}, "fourteen": {"file_name": "D0_anom_scatter_jet.png", "caption": "Mean extended winter Jet latitude and width, blue line represents a linear regression model fitted to the dataset, while light blue shading represents 95\\% confidence interval of this model computed using a bootstrapping method.", "link": "https://github.com/peterm790/MASTERS/blob/main/JET/Day\\_Zero\\_1D.ipynb", "key": "fourteen"}, "fifteen": {"file_name": "D0_jet_shade_anom.png", "caption": "ERA5 jet distribution anomaly during the 2015-2017 period.", "link": "https://github.com/peterm790/MASTERS/blob/main/JET/Day\\_Zero\\_2D.ipynb", "key": "fifteen"}, "sixteen": {"file_name": "jet_scores.png", "caption": "Area difference Scores and Rank across the different metrics, assessed against seasonal distributions(1d) or probabilities(2d) ", "link": "https://github.com/peterm790/MASTERS/blob/main/JET/Results\\_Heatmap.ipynb", "key": "sixteen"}}